In [ ]:
## https://www.kaggle.com/datasets/shivan118/hranalysis datset source

<div style="text-align: center;background-color:#f0e9d5; padding:10px; border-left: 5px solid #4CAF50; font-family: Trebuchet MS; font-size: 20px; color: #333;">
  LOAD LIBRARY & DATA
</div>

In [8]:
import pandas as pd
import chardet
import plotly.express as px
import plotly.graph_objects as go

### Find current working derectory

In [15]:
import os
current_directory = os.getcwd()
print(current_directory)

F:\Akhil\KPIs

#### Find encoding for csv file & laod dataset

In [20]:

with open("../datasets/test_2umaH9m.csv", 'rb') as f:
    result = chardet.detect(f.read())
print(result)
data = pd.read_csv("../datasets/test_2umaH9m.csv", encoding=result['encoding'])

{'encoding': 'ascii', 'confidence': 1.0, 'language': ''}

In [21]:
data.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61

<div style="text-align: center;background-color:#f0e9d5; padding:10px; border-left: 5px solid #4CAF50; font-family: Trebuchet MS; font-size: 20px; color: #333;">
  know Your Data 
</div>

In [22]:
data.shape

(23490, 13)

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23490 entries, 0 to 23489
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           23490 non-null  int64
 1   department            23490 non-null  object
 2   region                23490 non-null  object
 3   education             22456 non-null  object
 4   gender                23490 non-null  object
 5   recruitment_channel   23490 non-null  object
 6   no_of_trainings       23490 non-null  int64
 7   age                   23490 non-null  int64
 8   previous_year_rating  21678 non-null  float64
 9   length_of_service     23490 non-null  int64
 10  KPIs_met >80%         23490 non-null  int64
 11  awards_won?           23490 non-null  int64
 12  avg_training_score    23490 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 2.3+ MB

### Unique value per column

In [43]:
from IPython.display import display

def check_columns(data):
    """
    Display a table showing the number of unique values for each column in the DataFrame.
    """
    unique_counts = {
        "Column": data.columns,
        "Unique Values": [data[col].nunique() for col in data.columns]
    }
    
    result_df = pd.DataFrame(unique_counts)
    display(result_df)
check_columns(data)

                  Column  Unique Values
0            employee_id          23490
1             department              9
2                 region             34
3              education              3
4                 gender              2
5    recruitment_channel              3
6        no_of_trainings              9
7                    age             41
8   previous_year_rating              5
9      length_of_service             34
10         KPIs_met >80%              2
11           awards_won?              2
12    avg_training_score             61

### No. of Null value per column

In [47]:
def check_columns(data):
    """
    Display a table showing the number of unique values for each column in the DataFrame.
    """
    null_counts = {
        "Column": data.columns,
        "Null Values": [data[col].isnull().sum() for col in data.columns]
    }
    
    result_df = pd.DataFrame(null_counts)
    display(result_df)
check_columns(data)

                  Column  Null Values
0            employee_id            0
1             department            0
2                 region            0
3              education         1034
4                 gender            0
5    recruitment_channel            0
6        no_of_trainings            0
7                    age            0
8   previous_year_rating         1812
9      length_of_service            0
10         KPIs_met >80%            0
11           awards_won?            0
12    avg_training_score            0

### Check for data Duplicate

In [51]:
print(data.duplicated().sum())

0

In [49]:
data.describe()

,employee_id,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score
count,23490.000000,23490.000000,23490.000000,21678.000000,23490.000000,23490.000000,23490.000000,23490.000000
mean,39041.399149,1.254236,34.782929,3.339146,5.810387,0.358834,0.022776,63.263133
std,22640.809201,0.600910,7.679492,1.263294,4.207917,0.479668,0.149191,13.411750
min,3.000000,1.000000,20.000000,1.000000,1.000000,0.000000,0.000000,39.000000
25%,19370.250000,1.000000,29.000000,3.000000,3.000000,0.000000,0.000000,51.000000
50%,38963.500000,1.000000,33.000000,3.000000,5.000000,0.000000,0.000000,60.000000
75%,58690.000000,1.000000,39.000000,4.000000,7.000000,1.000000,0.000000,76.000000
max,78295.000000,9.000000,60.000000,5.000000,34.000000,1.000000,1.000000,99.000000

<div style="text-align: center;background-color:#f0e9d5; padding:10px; border-left: 5px solid #4CAF50; font-family: Trebuchet MS; font-size: 20px; color: #333;">
  Data Cleaning 
</div>

* **As per previous section, we find that 'education' and 'previuos year rating' column has lots of null value**

*  **let's clean that null vlaues**

In [56]:
data.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61